OdDAI.Model.repository(OdDAI.Repository*)
details
Sets a repository that contains the model.

OdDAI.Model.name(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a name of the model.

OdDAI.Model.getIsWriting
\details
Retrieves whether the model is being written to a file.
\returns true if the model is being written to a file at the moment of the method call; otherwise, the method returns false.

OdDAI.Model.getIsLoading
\details
Retrieves whether the SDAI model is currently being loaded from a file.
\returns true if the model is currently is being loaded from a file; otherwise, the method returns false.

OdDAI.Model.recalcInverseAttributes
\details
Forcibly calculates inverse attributes for all application instances within model.
\returns Returns eOk if the inverse attributes have been successfully updated; otherwise, the method returns an appropriate error.

OdDAI.Model.getModelContents
\details
Retrieves contents of a model.
\returns A smart pointer to model content.
\remarks
The specification allows access to model content directly or using the late-bound getAttr() function, however, we still keep model contents in the private section.

OdDAI.Model.entityInstancesCount
\details
Retrieves the count of all entity instances in this model.
\returns A signed 32-bit integer value that contains the count of all entity instances within the model.

OdDAI.Model.promoteModelToReadWrite
\details
Changes the access mode for the SDAI model from the read-only to the read-write.

OdDAI.Model.closeModel
\details
Closes the SDAI model.
When the model is close any access to it ends.
\details
Closes the SDAI model.
When the model is close any access to it ends.

OdDAI.Model.mode
\details
Retrieves the current access mode for the SDAI model.
\returns Current access mode of the model.

OdDAI.Model.unloadEntityExtent(OdSmartPtr&lt;OdDAI.Entity&gt;)
\details
Unload application instances specified by the definition.
\param entityDef [in] A raw pointer to the entity that represents the entity definition.
\returns true if entities were unloaded successfully; otherwise, the method returns false.

OdDAI.Model.unloadEntityExtent(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
** \details
** \details
\details
Unloads application instance specified with its name.
\param entityName [in] An entity's name.
\returns true if objects were unloaded successfully; otherwise, the method returns false.

OdDAI.Model.getEntityExtent(OdSmartPtr&lt;OdDAI.Entity&gt;)
\details
Retrieves the collection of entity instances, which entity types are subtypes of the specified entity definition.
\param entityDef [in] An smart pointer to the entity definition.
\returns A smart pointer to the entity extent that stores the collection of entity instances.

OdDAI.Model.getEntityExtent_(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the collection of entity instances with entity type which is kind of entityName.
\param entityName [in] An entity's name.
\returns A smart pointer to entity extent that keeps the collection of entity instances.

OdDAI.Model.newIterator
\details
Creates an iterator to get sequential access to all entities of the model.
\returns A smart pointer to the model's instance iterator.

OdDAI.Model.deleteInstance(OdDAI.ApplicationInstance*)
\details
Deletes a specified entity instance from the model.
\param inst [in] A raw pointer to the entity instance to be deleted.
\remarks
When the method is called the specified instance is marked as deleted, but it still stays in the model.
The deleted instance is not written to the file.
During the next file reading operation, the instance will not be read from the file
therefore it will be physically removed from the model.

OdDAI.Model.insertEntityInstance(OdSmartPtr&lt;OdDAI.ApplicationInstance&gt;,OdDbHandle!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Inserts a newly created entity instance to the model.
\param instanceToInsert [in] A smart pointer to the entity instance to be inserted.
\param insertHandle     [in] A handle of the parent object where to insert the entity instance.
\returns An identifier of the inserted entity instance.
\remarks
If the entity being inserted already belongs to another model or it has been already appended or inserted before, the method returns a NULL object identifier.
If the specified database handle already exists in the model, the entity defined with this handle gets a new handle value
and the inserted entity (specified with the pInstanceToInsert parameter) takes the passed handle value (the insertHandle parameter value).

OdDAI.Model.createEntityInstance(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Creates a new instance of a specified entity type.
\param entityTypeName [in] A string that contains the type name of the new entity to be created.
\returns A smart pointer to the created entity instance.
\remarks
If the current schema does not support the specified type, the method returns a NULL smart pointer.
In this case, the isNull() method of the smart pointer object returns true.
The created entity is not attached to the model.

OdDAI.Model.createEntityInstance(OdDAI.Entity!System.Runtime.CompilerServices.IsConst*)
\details
Creates a new instance of a specified entity type.
\param entityDef [in] A raw pointer to the entity definition that contains the type name of the new entity to be created.
\returns A smart pointer to the created entity instance.
\remarks
If the current schema does not support the specified type, the method returns a NULL smart pointer.
In this case, the isNull() method of the smart pointer object returns true.
The created entity is not attached to the model and doesn't have object identifier.

OdDAI.Model.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of the attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns The current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.

OdDAI.Model.underlyingSchemaName
\details
Retrieves the name of the model's underlying schema.
\returns An ANSI string that contains the name of the model's underlying schema.

OdDAI.Model.underlyingSchema
\details
Retrieves the underlying schema definition of the model.
\returns A smart pointer to the model's underlying schema definition.

OdDAI.Model.getEntityDefinition(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves an entity definition by its name.
\param entityName [in] The name of an entity definition.
\returns A raw pointer to the entity definition.
\remarks
If there is no entity definition with the specified name, the method returns a NULL pointer.

OdDAI.Model.renameModel(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assigns a new name to the specified SDAI model.
\param modelName [in] A string that contains the new name of the SDAI model.

OdDAI.Model.repository
\details
Retrieves a repository that contains the model.
\returns A raw pointer to the repository that contains the model.

OdDAI.Model.name
\details
Retrieves the name of the model.
\returns A string that contains the name of the model.

OdDAI.Model.initialize(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdSmartPtr&lt;OdDAI.Schema&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.Repository*)
\details
Initializes the model object and creates a minimal model hierarchy based on a specified schema.
\param name   [in] A string that contains the schema's name.
\param schema [out] A placeholder for a schema object.
\param repo   [in] A raw pointer to a repository object that is associated with the model.

OdDAI.Model.initialize(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.Repository*)
\details
Initializes the model object and creates a minimal model hierarchy based on a schema with the specified name.
\param name       [in] A string that contains the model's name.
\param schemaName [in] A string that contains the schema's name.
\param repo       [in] A raw pointer to a repository object that is associated with the model.

OdDAI.Model
\details
A class that implements functionality for working with models.